In [2]:
import numpy as np
from pandas import Series,DataFrame
import pandas as pd

In [3]:
#Now we'll learn how to deal with missing data, a very common task when analyzing datasets!

data = Series(['one','two', np.nan, 'four'])

In [4]:
#Show data
data

0     one
1     two
2     NaN
3    four
dtype: object

In [5]:
#Find the missing values
data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
#We can simply drop the NAN 
data.dropna()

0     one
1     two
3    four
dtype: object

In [7]:
# In a DataFrame we need to be a little more careful!

dframe = DataFrame([[1,2,3],[np.nan,5,6],[7,np.nan,9],[np.nan,np.nan,np.nan]])

In [8]:
#Show
dframe

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [10]:
clean_dframe = dframe.dropna()

In [9]:
#Show
clean_dframe

     0    1    2
0  1.0  2.0  3.0

In [10]:
#Note all rows where an NA occured was a drop of the entire row

In [13]:
#We can also specify to only drop rows that are complete missing all data

dframe.dropna(how="all")

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [14]:
#Or we can specify to drop columns with missing data

dframe.dropna(axis=1)
#This should drop all columns out since every column contains at least 1 NAN

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [15]:
#We can also threshold teh missing data as well

#For example if we only want rows with at least 3 data points
dframe2 = DataFrame([[1,2,3,np.nan],[2,np.nan,5,6],[np.nan,7,np.nan,9],[1,np.nan,np.nan,np.nan]])

#Show
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [16]:
#Droppin any rows tht dont have at least 2 data points
dframe2.dropna(thresh=2)

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0

In [17]:
#Dropiing rows without at least 3 data points
dframe2.dropna(thresh=3)

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0

In [18]:
#We can also fill any NAN
dframe2.fillna(1)

     0    1    2    3
0  1.0  2.0  3.0  1.0
1  2.0  1.0  5.0  6.0
2  1.0  7.0  1.0  9.0
3  1.0  1.0  1.0  1.0

In [20]:
#Can also fill in diff values for diff columns
dframe2.fillna(value=1)

     0    1    2    3
0  1.0  2.0  3.0  1.0
1  2.0  1.0  5.0  6.0
2  1.0  7.0  1.0  9.0
3  1.0  1.0  1.0  1.0

In [21]:
#Note that we still have access to the original dframe
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [22]:
#If we want to modify the exsisting object, use inplace
dframe2.fillna(0,inplace=True)

In [23]:
#Now let's see the dframe
dframe2

     0    1    2    3
0  1.0  2.0  3.0  0.0
1  2.0  0.0  5.0  6.0
2  0.0  7.0  0.0  9.0
3  1.0  0.0  0.0  0.0

In [ ]:
#Awesome! Next we'll learn about Index Hierarchy